MyoMod/MyoMod-DPU/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x080000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR27_GPIO_MUX2_GPIO_SEL_MASK 0x08U /*!< GPIO2 and GPIO7 share same IO MUX function, GPIO_MUX2 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR29_GPIO_MUX4_GPIO_SEL_MASK 0x0170U /*!< GPIO4 and GPIO9 share same IO MUX function, GPIO_MUX4 selects one GPIO function: affected bits mask */

/* GPIO_B0_03 (coord D8), USR_LED */
/* Routed pin properties */
#define BOARD_INITPINS_USR_LED_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_USR_LED_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USR_LED_CHANNEL                                        3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USR_LED_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USR_LED_GPIO_PIN                                       3U   /*!< GPIO pin number */
#define BOARD_INITPINS_USR_LED_GPIO_PIN_MASK                          (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_USR_LED_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_USR_LED_PIN                                            3U   /*!< PORT pin number */
#define BOARD_INITPINS_USR_LED_PIN_MASK                               (1U << 3U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (coord J12), CSI_VSYNC/J35[18]/J22[2]/UART_TX */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_VSYNC_PERIPHERAL                               LPI2C3   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_VSYNC_SIGNAL                                      SDA   /*!< Signal name */

/* GPIO_AD_B1_07 (coord K10), CSI_HSYNC/J35[16]/J22[1]/UART_RX */
/* Routed pin properties */
#define BOARD_INITPINS_CSI_HSYNC_PERIPHERAL                               LPI2C3   /*!< Peripheral name */
#define BOARD_INITPINS_CSI_HSYNC_SIGNAL                                      SCL   /*!< Signal name */

/* GPIO_AD_B1_03 (coord M12), Sync */
/* Routed pin properties */
#define BOARD_INITPINS_Sync_PERIPHERAL                                     GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_Sync_SIGNAL                                       gpio_io   /*!< Signal name */
#define BOARD_INITPINS_Sync_CHANNEL                                          19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Sync_GPIO                                           GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_Sync_GPIO_PIN                                         19U   /*!< GPIO pin number */
#define BOARD_INITPINS_Sync_GPIO_PIN_MASK                            (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_Sync_PORT                                           GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_Sync_PIN                                              19U   /*!< PORT pin number */
#define BOARD_INITPINS_Sync_PIN_MASK                                 (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B0_12 (coord K14), SCL4 */
/* Routed pin properties */
#define BOARD_INITPINS_SCL4_PERIPHERAL                                    LPI2C4   /*!< Peripheral name */
#define BOARD_INITPINS_SCL4_SIGNAL                                           SCL   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), SDA4 */
/* Routed pin properties */
#define BOARD_INITPINS_SDA4_PERIPHERAL                                    LPI2C4   /*!< Peripheral name */
#define BOARD_INITPINS_SDA4_SIGNAL                                           SDA   /*!< Signal name */

/* GPIO_EMC_04 (coord F2), SW_UP */
/* Routed pin properties */
#define BOARD_INITPINS_SW_UP_PERIPHERAL                                    GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_SW_UP_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SW_UP_CHANNEL                                          4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SW_UP_GPIO                                          GPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SW_UP_GPIO_PIN                                         4U   /*!< GPIO pin number */
#define BOARD_INITPINS_SW_UP_GPIO_PIN_MASK                            (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SW_UP_PORT                                          GPIO4   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SW_UP_PIN                                              4U   /*!< PORT pin number */
#define BOARD_INITPINS_SW_UP_PIN_MASK                                 (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_08 (coord H3), SW_MOD */
/* Routed pin properties */
#define BOARD_INITPINS_SW_MOD_PERIPHERAL                                   GPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_SW_MOD_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SW_MOD_CHANNEL                                         8U   /*!< Signal channel */

